# Flight Price Prediction  EDA and  Feature Engineering

importing libraries for EDA

In [475]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

from matplotlib.pyplot import rcParams

Loading train set

In [476]:
train = pd.read_excel("D:\\complete machine learning course\\5-Days-Live-EDA-and-Feature-Engineering-main\\5-Days-Live-EDA-and-Feature-Engineering-main\\Flight Prediction\\Data_Train.xlsx")
train.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

#### Checking duplicates in train set

In [477]:
train[train.duplicated()]

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
683,Jet Airways,1/06/2019,Delhi,Cochin,DEL → NAG → BOM → COK,14:35,04:25 02 Jun,13h 50m,2 stops,No info,13376
1061,Air India,21/05/2019,Delhi,Cochin,DEL → GOI → BOM → COK,22:00,19:15 22 May,21h 15m,2 stops,No info,10231
1348,Air India,18/05/2019,Delhi,Cochin,DEL → HYD → BOM → COK,17:15,19:15 19 May,26h,2 stops,No info,12392
1418,Jet Airways,6/06/2019,Delhi,Cochin,DEL → JAI → BOM → COK,05:30,04:25 07 Jun,22h 55m,2 stops,In-flight meal not included,10368
1674,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,18:25,21:20,2h 55m,non-stop,No info,7303
...,...,...,...,...,...,...,...,...,...,...,...
10594,Jet Airways,27/06/2019,Delhi,Cochin,DEL → AMD → BOM → COK,23:05,12:35 28 Jun,13h 30m,2 stops,No info,12819
10616,Jet Airways,1/06/2019,Delhi,Cochin,DEL → JAI → BOM → COK,09:40,12:35 02 Jun,26h 55m,2 stops,No info,13014
10634,Jet Airways,6/06/2019,Delhi,Cochin,DEL → JAI → BOM → COK,09:40,12:35 07 Jun,26h 55m,2 stops,In-flight meal not included,11733
10672,Jet Airways,27/06/2019,Delhi,Cochin,DEL → AMD → BOM → COK,23:05,19:00 28 Jun,19h 55m,2 stops,In-flight meal not included,11150
10673,Jet Airways,27/05/2019,Delhi,Cochin,DEL → AMD → BOM → COK,13:25,04:25 28 May,15h,2 stops,No info,16704

#### droping duplicates in train set

In [478]:
train.drop_duplicates(inplace=True)

In [479]:
train[train.duplicated()]

Empty DataFrame
Columns: [Airline, Date_of_Journey, Source, Destination, Route, Dep_Time, Arrival_Time, Duration, Total_Stops, Additional_Info, Price]
Index: []

### Loading test set

In [480]:
test = pd.read_excel("D:\\complete machine learning course\\5-Days-Live-EDA-and-Feature-Engineering-main\\5-Days-Live-EDA-and-Feature-Engineering-main\\Flight Prediction\\Test_set.xlsx")
test.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
0,Jet Airways,6/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,04:25 07 Jun,10h 55m,1 stop,No info
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → MAA → BLR,06:20,10:20,4h,1 stop,No info
2,Jet Airways,21/05/2019,Delhi,Cochin,DEL → BOM → COK,19:15,19:00 22 May,23h 45m,1 stop,In-flight meal not included
3,Multiple carriers,21/05/2019,Delhi,Cochin,DEL → BOM → COK,08:00,21:00,13h,1 stop,No info
4,Air Asia,24/06/2019,Banglore,Delhi,BLR → DEL,23:55,02:45 25 Jun,2h 50m,non-stop,No info

Checking duplicates in test set

In [481]:
test[test.duplicated()].head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
294,Jet Airways,12/06/2019,Delhi,Cochin,DEL → JAI → BOM → COK,05:30,04:25 13 Jun,22h 55m,2 stops,No info
794,Jet Airways,12/06/2019,Delhi,Cochin,DEL → JAI → BOM → COK,05:30,04:25 13 Jun,22h 55m,2 stops,In-flight meal not included
909,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,20:00,22:55,2h 55m,non-stop,No info
974,Air India,12/06/2019,Kolkata,Banglore,CCU → DEL → AMD → BLR,07:00,05:25 13 Jun,22h 25m,2 stops,No info
1011,Jet Airways,9/05/2019,Delhi,Cochin,DEL → JAI → BOM → COK,05:30,04:25 10 May,22h 55m,2 stops,No info

Droping duplicates

In [482]:
test.drop_duplicates(inplace = True)

In [483]:
test[test.duplicated()]

Empty DataFrame
Columns: [Airline, Date_of_Journey, Source, Destination, Route, Dep_Time, Arrival_Time, Duration, Total_Stops, Additional_Info]
Index: []

Looking at columns in train and test sets

In [484]:
train.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Route',
       'Dep_Time', 'Arrival_Time', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price'],
      dtype='object')

In [485]:
test.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Route',
       'Dep_Time', 'Arrival_Time', 'Duration', 'Total_Stops',
       'Additional_Info'],
      dtype='object')

Concatinating both train and test

In [486]:
final = pd.concat([train,test], axis = 0)
final.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0

In [487]:
final.tail()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
2666,Air India,6/06/2019,Kolkata,Banglore,CCU → DEL → BLR,20:30,20:25 07 Jun,23h 55m,1 stop,No info,NaN
2667,IndiGo,27/03/2019,Kolkata,Banglore,CCU → BLR,14:20,16:55,2h 35m,non-stop,No info,NaN
2668,Jet Airways,6/03/2019,Delhi,Cochin,DEL → BOM → COK,21:50,04:25 07 Mar,6h 35m,1 stop,No info,NaN
2669,Air India,6/03/2019,Delhi,Cochin,DEL → BOM → COK,04:00,19:15,15h 15m,1 stop,No info,NaN
2670,Multiple carriers,15/06/2019,Delhi,Cochin,DEL → BOM → COK,04:55,19:15,14h 20m,1 stop,No info,NaN

Observation : When concatinating train and test price columns have NaN values as we don't have Price in test set

In [488]:
final.shape

(13108, 11)

In [489]:
final[final.duplicated()]

Empty DataFrame
Columns: [Airline, Date_of_Journey, Source, Destination, Route, Dep_Time, Arrival_Time, Duration, Total_Stops, Additional_Info, Price]
Index: []

Observation : As we droped duplicated values in both train and test now in combined data set we don't have duplicates

Looking at info

In [490]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13108 entries, 0 to 2670
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13108 non-null  object
 1   Date_of_Journey  13108 non-null  object
 2   Source           13108 non-null  object
 3   Destination      13108 non-null  object
 4   Route            13107 non-null  object
 5   Dep_Time         13108 non-null  object
 6   Arrival_Time     13108 non-null  object
 7   Duration         13108 non-null  object
 8   Total_Stops      13107 non-null  object
 9   Additional_Info  13108 non-null  object
 10  Price            10463 non-null  float64
dtypes: float64(1), object(10)
memory usage: 1.2+ MB

Looking at NaN values

In [491]:
final.isna().sum()

Airline               0
Date_of_Journey       0
Source                0
Destination           0
Route                 1
Dep_Time              0
Arrival_Time          0
Duration              0
Total_Stops           1
Additional_Info       0
Price              2645
dtype: int64

In [492]:
final[final.Route.isna()]

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
9039,Air India,6/05/2019,Delhi,Cochin,NaN,09:45,09:25 07 May,23h 40m,NaN,No info,7480.0

Droping NaN values

In [493]:
final.dropna(subset = ['Route'],inplace=True)

In [494]:
final.isna().sum()

Airline               0
Date_of_Journey       0
Source                0
Destination           0
Route                 0
Dep_Time              0
Arrival_Time          0
Duration              0
Total_Stops           0
Additional_Info       0
Price              2645
dtype: int64

Observation : NaN values are droped

In [495]:
final.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0

Converting Date_of_Journey categorical feature to numeric feature

In [496]:
final['Journey_day'] = final['Date_of_Journey'].str.split('/').str[0].astype(int)
final['Journey_month'] = final['Date_of_Journey'].str.split('/').str[1].astype(int)
final['Journey_year'] = final['Date_of_Journey'].str.split('/').str[2].astype(int)

In [497]:
final.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Journey_day,Journey_month,Journey_year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,5,2019

Now we can drop Date_of_Journey feature

In [498]:
final.drop(columns = 'Date_of_Journey', inplace=True)

In [499]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13107 entries, 0 to 2670
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13107 non-null  object
 1   Source           13107 non-null  object
 2   Destination      13107 non-null  object
 3   Route            13107 non-null  object
 4   Dep_Time         13107 non-null  object
 5   Arrival_Time     13107 non-null  object
 6   Duration         13107 non-null  object
 7   Total_Stops      13107 non-null  object
 8   Additional_Info  13107 non-null  object
 9   Price            10462 non-null  float64
 10  Journey_day      13107 non-null  int32
 11  Journey_month    13107 non-null  int32
 12  Journey_year     13107 non-null  int32
dtypes: float64(1), int32(3), object(9)
memory usage: 1.2+ MB

Concerting Dep_Time into Dep_hour and Dep_min

In [500]:
final['Dep_hour'] = final['Dep_Time'].str.split(':').str[0].astype(int)
final['Dep_min'] = final['Dep_Time'].str.split(':').str[1].astype(int)

Converting Arrival_Time into Arrival_hour and Arrival_min

In [501]:
final.Arrival_Time.str.split(' ').head()#.str[0].str.split(':').str[0]

0    [01:10, 22, Mar]
1             [13:15]
2    [04:25, 10, Jun]
3             [23:30]
4             [21:35]
Name: Arrival_Time, dtype: object

In [502]:
final.Arrival_Time.str.split(' ').str[0].head()

0    01:10
1    13:15
2    04:25
3    23:30
4    21:35
Name: Arrival_Time, dtype: object

In [503]:
final.Arrival_Time.str.split(' ').str[0].str.split(':').head()

0    [01, 10]
1    [13, 15]
2    [04, 25]
3    [23, 30]
4    [21, 35]
Name: Arrival_Time, dtype: object

In [504]:
final.Arrival_Time.str.split(' ').str[0].str.split(':').str[0].head()

0    01
1    13
2    04
3    23
4    21
Name: Arrival_Time, dtype: object

In [505]:
final.Arrival_Time.str.split(' ').str[0].str.split(':').str[1].head()

0    10
1    15
2    25
3    30
4    35
Name: Arrival_Time, dtype: object

In [506]:
final['Arrival_hour'] = final.Arrival_Time.str.split(' ').str[0].str.split(':').str[0].head().astype(int)
final['Arrival_min'] = final.Arrival_Time.str.split(' ').str[0].str.split(':').str[1].head().astype(int)

In [507]:
final.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019,22,20,1.0,10.0
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,5,2019,5,50,13.0,15.0

droping Dep_Time and Arrival_Time

In [508]:
final.drop(columns = ['Dep_Time', 'Arrival_Time'], inplace = True)

In [509]:
final.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,non-stop,No info,3897.0,24,3,2019,22,20,1.0,10.0
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2 stops,No info,7662.0,1,5,2019,5,50,13.0,15.0

converting Total_Stops categorical feature to numeric feature

In [510]:
final['Total_Stops'].value_counts().sort_index().index

Index(['1 stop', '2 stops', '3 stops', '4 stops', 'non-stop'], dtype='object')

In [511]:
final[final['Total_Stops'].isna()]

Empty DataFrame
Columns: [Airline, Source, Destination, Route, Duration, Total_Stops, Additional_Info, Price, Journey_day, Journey_month, Journey_year, Dep_hour, Dep_min, Arrival_hour, Arrival_min]
Index: []

Using OrdinalEncoder to encode categorical data

In [512]:
from sklearn.preprocessing import OrdinalEncoder
oe = OrdinalEncoder(categories = [['non-stop', '1 stop', '2 stops', '3 stops', '4 stops']])
final['Total_Stops_en'] = oe.fit_transform(final[['Total_Stops']])
final.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,Total_Stops_en
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,non-stop,No info,3897.0,24,3,2019,22,20,1.0,10.0,0.0
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2 stops,No info,7662.0,1,5,2019,5,50,13.0,15.0,2.0

Droping Total_stops feature

In [513]:
final.drop(columns = 'Total_Stops', inplace = True)

In [514]:
final.head(2)

,Airline,Source,Destination,Route,Duration,Additional_Info,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,Total_Stops_en
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,No info,3897.0,24,3,2019,22,20,1.0,10.0,0.0
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,No info,7662.0,1,5,2019,5,50,13.0,15.0,2.0

Converting Duration of given hours and mins to total no.of mins

In [515]:
# initially while converting dtype and minutes I have come across below error
# final.Duration.str.split('h').str[0].astype(int)
# ValueError: invalid literal for int() with base 10: '5m'

In [516]:
# converted duration hours into min
final.Duration.str.split('h').str[0].str.replace('m','').astype(int)*60

0        120
1        420
2       1140
3        300
4        240
        ...
2666    1380
2667     120
2668     360
2669     900
2670     840
Name: Duration, Length: 13107, dtype: int32

In [517]:
final[final.Duration.isna()]

Empty DataFrame
Columns: [Airline, Source, Destination, Route, Duration, Additional_Info, Price, Journey_day, Journey_month, Journey_year, Dep_hour, Dep_min, Arrival_hour, Arrival_min, Total_Stops_en]
Index: []

In [518]:
final[final.Duration.str.split('h').str[1].str.replace('m','').replace('','0').isna()]

,Airline,Source,Destination,Route,Duration,Additional_Info,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,Total_Stops_en
6474,Air India,Mumbai,Hyderabad,BOM → GOI → PNQ → HYD,5m,No info,17327.0,6,3,2019,16,50,NaN,NaN,2.0
2660,Air India,Mumbai,Hyderabad,BOM → GOI → PNQ → HYD,5m,No info,NaN,12,3,2019,16,50,NaN,NaN,2.0

In [519]:
# we have 2 na vaulues when we consider min in Duration

In [520]:
final[final.Duration.str.split('h').str[1].str.replace('m','').replace('','0').isna()].index

Int64Index([6474, 2660], dtype='int64')

Observation : these entries have some inconsistancy, having 2 stops definitely make you reach in 5m from BOM to HYD

In [521]:
final.drop(axis = 0, index = [6474, 2660], inplace = True)

In [522]:
final[final.Duration.str.split('h').str[1].str.replace('m','').replace('','0').isna()]

Empty DataFrame
Columns: [Airline, Source, Destination, Route, Duration, Additional_Info, Price, Journey_day, Journey_month, Journey_year, Dep_hour, Dep_min, Arrival_hour, Arrival_min, Total_Stops_en]
Index: []

In [523]:
# Duration mins
final.Duration.str.split('h').str[1].str.replace('m','').replace('','0').astype(int)

0       50
1       25
2        0
3       25
4       45
        ..
2666    55
2667    35
2668    35
2669    15
2670    20
Name: Duration, Length: 13104, dtype: int32

In [524]:
# Total Duration in total min
final['Duration_min'] = final.Duration.str.split('h').str[0].str.replace('m','').astype(int)*60+final.Duration.str.split('h').str[1].str.replace('m','').replace('','0').astype(int)
final['Duration_min'].head()

0     170
1     445
2    1140
3     325
4     285
Name: Duration_min, dtype: int32

In [525]:
final.head(2)

,Airline,Source,Destination,Route,Duration,Additional_Info,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,Total_Stops_en,Duration_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,No info,3897.0,24,3,2019,22,20,1.0,10.0,0.0,170
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,No info,7662.0,1,5,2019,5,50,13.0,15.0,2.0,445

Droping Duration feature

In [526]:
final.drop(columns = 'Duration', inplace = True, axis = 1)

In [527]:
final.head(2)

,Airline,Source,Destination,Route,Additional_Info,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,Total_Stops_en,Duration_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,No info,3897.0,24,3,2019,22,20,1.0,10.0,0.0,170
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,No info,7662.0,1,5,2019,5,50,13.0,15.0,2.0,445

In [528]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13104 entries, 0 to 2670
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13104 non-null  object
 1   Source           13104 non-null  object
 2   Destination      13104 non-null  object
 3   Route            13104 non-null  object
 4   Additional_Info  13104 non-null  object
 5   Price            10460 non-null  float64
 6   Journey_day      13104 non-null  int32
 7   Journey_month    13104 non-null  int32
 8   Journey_year     13104 non-null  int32
 9   Dep_hour         13104 non-null  int32
 10  Dep_min          13104 non-null  int32
 11  Arrival_hour     10 non-null     float64
 12  Arrival_min      10 non-null     float64
 13  Total_Stops_en   13104 non-null  float64
 14  Duration_min     13104 non-null  int32
dtypes: float64(4), int32(6), object(5)
memory usage: 1.3+ MB

Now we focus on Route feature

In [529]:
final['Route']
# for Route Route we have information like below

0                   BLR → DEL
1       CCU → IXR → BBI → BLR
2       DEL → LKO → BOM → COK
3             CCU → NAG → BLR
4             BLR → NAG → DEL
                ...
2666          CCU → DEL → BLR
2667                CCU → BLR
2668          DEL → BOM → COK
2669          DEL → BOM → COK
2670          DEL → BOM → COK
Name: Route, Length: 13104, dtype: object

From Route data we could get source and destination --> ok
we can also get no.of stops present in between source and destination --> ok

But we already have this information in our dataset

Apart from source and destination if we want to create a column for each stop we will be getting
    more no.of NaN values.

But if we do for the forther analysis that could be used for 
    from source to destination how lesser the time is
    what is cost difference when source and destination same
                                but no.of stops and the route that has choosen

But now we were not focusing on that 
    from this we could get source, destination and no.of stops 
    as those are already there we will be droping the column

Droping Route features

In [530]:
final.drop(columns = 'Route', axis = 1, inplace = True)

In [531]:
final.head(2)

,Airline,Source,Destination,Additional_Info,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,Total_Stops_en,Duration_min
0,IndiGo,Banglore,New Delhi,No info,3897.0,24,3,2019,22,20,1.0,10.0,0.0,170
1,Air India,Kolkata,Banglore,No info,7662.0,1,5,2019,5,50,13.0,15.0,2.0,445

In [532]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13104 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13104 non-null  object
 1   Source           13104 non-null  object
 2   Destination      13104 non-null  object
 3   Additional_Info  13104 non-null  object
 4   Price            10460 non-null  float64
 5   Journey_day      13104 non-null  int32
 6   Journey_month    13104 non-null  int32
 7   Journey_year     13104 non-null  int32
 8   Dep_hour         13104 non-null  int32
 9   Dep_min          13104 non-null  int32
 10  Arrival_hour     10 non-null     float64
 11  Arrival_min      10 non-null     float64
 12  Total_Stops_en   13104 non-null  float64
 13  Duration_min     13104 non-null  int32
dtypes: float64(4), int32(6), object(4)
memory usage: 1.2+ MB

For Source and Destination
    We are not just doing label/Ordinal encoding 
Because in Source and Destination we have same categories
Because of that reason we are assigning unique numbers to unique categories

In [533]:
# Source unique values as a
a = set(final.Source.unique())
a

{'Banglore', 'Chennai', 'Delhi', 'Kolkata', 'Mumbai'}

In [534]:
# Destination unique values as b
b = set(final.Destination.unique())
b

{'Banglore', 'Cochin', 'Delhi', 'Hyderabad', 'Kolkata', 'New Delhi'}

In [535]:
# in both a and b
a.intersection(b)

{'Banglore', 'Delhi', 'Kolkata'}

In [536]:
# in both b and a
b.intersection(a)

{'Banglore', 'Delhi', 'Kolkata'}

In [537]:
# only in a not in b
a.difference(b)

{'Chennai', 'Mumbai'}

In [538]:
# only in b not in a
b.difference(a)

{'Cochin', 'Hyderabad', 'New Delhi'}

In [539]:
# in both a and b
a.union(b)
# we are getting Delhi and New Delhi as different

{'Banglore',
 'Chennai',
 'Cochin',
 'Delhi',
 'Hyderabad',
 'Kolkata',
 'Mumbai',
 'New Delhi'}

In [540]:
city_map = {'Banglore':1, 'Delhi':2, 'Kolkata':3, 'Chennai':4, 'Mumbai':5, 'Cochin':6, 'Hyderabad':7, 'New Delhi':8}

In [541]:
from sklearn.preprocessing import OrdinalEncoder
oe = OrdinalEncoder(categories={'Banglore':1, 'Delhi':2, 'Kolkata':3, 'Chennai':4, 'Mumbai':5})

In [542]:
final['Source_map'] = final['Source'].map({'Banglore':1, 'Delhi':2, 'Kolkata':3, 'Chennai':4, 'Mumbai':5})
final['Source_map'].head()

0    1
1    3
2    2
3    3
4    1
Name: Source_map, dtype: int64

In [543]:
final['Destination_map'] = final['Destination'].map({'Banglore':1, 'Delhi':2, 'Kolkata':3, 'Cochin':6, 'Hyderabad':7, 'New Delhi':2})
final['Destination_map'].head()                       
# Delhi and New Delhi are same

0    2
1    1
2    6
3    1
4    2
Name: Destination_map, dtype: int64

In [544]:
final[['Source', 'Destination','Source_map','Destination_map']]

        Source Destination  Source_map  Destination_map
0     Banglore   New Delhi           1                2
1      Kolkata    Banglore           3                1
2        Delhi      Cochin           2                6
3      Kolkata    Banglore           3                1
4     Banglore   New Delhi           1                2
...        ...         ...         ...              ...
2666   Kolkata    Banglore           3                1
2667   Kolkata    Banglore           3                1
2668     Delhi      Cochin           2                6
2669     Delhi      Cochin           2                6
2670     Delhi      Cochin           2                6

[13104 rows x 4 columns]

Droping Source and Destination

In [545]:
final.drop(columns = ['Source', 'Destination'], axis = 1, inplace = True)

In [546]:
final.head(2)

,Airline,Additional_Info,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,Total_Stops_en,Duration_min,Source_map,Destination_map
0,IndiGo,No info,3897.0,24,3,2019,22,20,1.0,10.0,0.0,170,1,2
1,Air India,No info,7662.0,1,5,2019,5,50,13.0,15.0,2.0,445,3,1

In [547]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13104 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13104 non-null  object
 1   Additional_Info  13104 non-null  object
 2   Price            10460 non-null  float64
 3   Journey_day      13104 non-null  int32
 4   Journey_month    13104 non-null  int32
 5   Journey_year     13104 non-null  int32
 6   Dep_hour         13104 non-null  int32
 7   Dep_min          13104 non-null  int32
 8   Arrival_hour     10 non-null     float64
 9   Arrival_min      10 non-null     float64
 10  Total_Stops_en   13104 non-null  float64
 11  Duration_min     13104 non-null  int32
 12  Source_map       13104 non-null  int64
 13  Destination_map  13104 non-null  int64
dtypes: float64(4), int32(6), int64(2), object(2)
memory usage: 1.2+ MB

Looking at Additional_Info and Airline

In [548]:
final['Additional_Info'].unique()

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [549]:
final['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [550]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [551]:
final['Additional_Info1'] = le.fit_transform(final['Additional_Info'])
final['Additional_Info1']

0       8
1       8
2       8
3       8
4       8
       ..
2666    8
2667    8
2668    8
2669    8
2670    8
Name: Additional_Info1, Length: 13104, dtype: int32

In [552]:
final['Additional_Info']

0       No info
1       No info
2       No info
3       No info
4       No info
         ...
2666    No info
2667    No info
2668    No info
2669    No info
2670    No info
Name: Additional_Info, Length: 13104, dtype: object

In [553]:
final['Airline1'] = le.fit_transform(final['Airline'])
final['Airline1']

0       3
1       1
2       4
3       3
4       3
       ..
2666    1
2667    3
2668    4
2669    1
2670    6
Name: Airline1, Length: 13104, dtype: int32

In [554]:
final['Airline']

0                  IndiGo
1               Air India
2             Jet Airways
3                  IndiGo
4                  IndiGo
              ...
2666            Air India
2667               IndiGo
2668          Jet Airways
2669            Air India
2670    Multiple carriers
Name: Airline, Length: 13104, dtype: object

Droping Airline, Additional_Info

In [555]:
final.drop(columns = ['Airline', 'Additional_Info'], axis = 1, inplace = True)

In [556]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13104 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Price             10460 non-null  float64
 1   Journey_day       13104 non-null  int32
 2   Journey_month     13104 non-null  int32
 3   Journey_year      13104 non-null  int32
 4   Dep_hour          13104 non-null  int32
 5   Dep_min           13104 non-null  int32
 6   Arrival_hour      10 non-null     float64
 7   Arrival_min       10 non-null     float64
 8   Total_Stops_en    13104 non-null  float64
 9   Duration_min      13104 non-null  int32
 10  Source_map        13104 non-null  int64
 11  Destination_map   13104 non-null  int64
 12  Additional_Info1  13104 non-null  int32
 13  Airline1          13104 non-null  int32
dtypes: float64(4), int32(8), int64(2)
memory usage: 1.1 MB

#### All the categorical features are transformed

In [557]:
final.head()

,Price,Journey_day,Journey_month,Journey_year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,Total_Stops_en,Duration_min,Source_map,Destination_map,Additional_Info1,Airline1
0,3897.0,24,3,2019,22,20,1.0,10.0,0.0,170,1,2,8,3
1,7662.0,1,5,2019,5,50,13.0,15.0,2.0,445,3,1,8,1
2,13882.0,9,6,2019,9,25,4.0,25.0,2.0,1140,2,6,8,4
3,6218.0,12,5,2019,18,5,23.0,30.0,1.0,325,3,1,8,3
4,13302.0,1,3,2019,16,50,21.0,35.0,1.0,285,1,2,8,3